<?php

// 1. Создайте переменную с названием value содержащую целое случайное число от 1 до 10 и выведите сообщение: "Полученное число больше 5", если это число действительно больше 5
// # Чтобы получить случайное число, воспользуйтесь функцией rand()
$value = rand(1, 10);
if ($value > 5) {
    var_dump('Полученное число больше 5');
}

// 2. Создайте переменную timeToLearn - поместите в нее случайное boolean значение
// Если в переменной будет значение true, то выведите сообщение: "Я как раз сейчас и учусь"
// Если в переменной будет значение false - то выведите сообщение: "Что? Нет, для учебы всегда есть время"
// # чтобы создать случайное boolean значение - можно воспользоваться функцией создания случайного числа - и преобразованием у boolean типу
// # Момент видео 44:34 (Управляющие конструкции, циклы, приведение типов)
$timeToLearn = (bool) rand(0, 1);
if ($timeToLearn) {
    // обратите внимания, что нет смысла сравнивать $timeToLearn == true, т.к. результат этого выражения - это boolean значение равное значению в переменной $timeToLearn
    var_dump("Я как раз сейчас и учусь");
} else {
    // Нет никаких проверок на false, т.к. никаких других вариантов уже быть не может
    var_dump("Что? Нет, для учебы всегда есть время");
}

// 3. Создайте переменную hour, содержащую текущее время в часах, поместите в нее случайное значение от 0 до 23
// Если текущее время находится в диапазоне от 0 до 8 - выведите сообщения: "В это время нужно спать"
// Если время находится в диапазоне от 8 до 21 - выведите сообщения: "В это время занимайтесь полезными делами, или поспите после обеда"
// Если время находится в диапазоне от 21 до 23 - выведите сообщения: "Самое время готовиться ко сну"
$hour = rand(0, 24);
if ($hour < 8) {
    // Не нужно проверять, что hour больше 0, диапазон возвращаемых значений жестко указан в функции rand
    var_dump("В это время нужно спать");
} elseif ($hour < 21) {
    // Не нужно проверять, что hour еще и больше 8, мы этот случай уже обработали первым условием
    var_dump("В это время занимайтесь полезными делами, или поспите после обеда");
} else {
    // А тут вообще не нужно ничего проверять, если два других условия не выполнились, то других вариантов и не осталось
    var_dump("Самое время готовиться ко сну");
}


// 4. Создайте константу HOURS_IN_DAY и укажите в нее продолжительность суток в часах
// добавьте условие, если значение константы не равно 24 - выведите сообщение: "Неужели я не знаю что в сутках 24 часа?"
// # Момент видео 00:50 (Встроенные (магические) константы, суперглобальные массивы)
define('HOURS_IN_DAY', 24);
if (HOURS_IN_DAY != 24) {
    var_dump('Неужели я не знаю что в сутках 24 часа?');
}

// 5. Даны три длины сторон треугольника, нужно понять существует ли такой треугольник.
// Создайте три переменные a, b, c - стороны треугольника, поместите в каждую из них случайное значение от 1 до 5
// Выведите сообщение, что "Треугольник со сторонами {} {} {} существует", или "Невозможно создать треугольник со сторонами {} {} {}",
// вместо {} - должны быть выведены реальные значения сторон треугольника
// # ... Вы же помните, для того, чтобы существовал треугольник: любая сторона должна быть больше суммы двух других сторон.
// # Нужно использовать оператор && и сравнить каждую сумму с третьей стороной
$a = rand(1, 5);
$b = rand(1, 5);
$c = rand(1, 5);

if ($a + $b > $c && $a + $c > $b && $b + $c > $a) {
    var_dump("Треугольник со сторонами $a $b $c существует");
} else {
    var_dump("Невозможно создать треугольник со сторонами $a $b $c");
}

// 6. Создайте переменную dayNumber, содержащую номер дня недели, поместите в нее случайное значение от 1 до 7
// Выведите это выходной или нет, если неделя начинается с воскресенья (1 день - это воскресенье)
$dayNumber = rand(1, 7);
if ($dayNumber == 1 || $dayNumber == 7) {
    var_dump("Это выходной");
} else {
    var_dump("Это будний день");
}

// или $dayNumber < 2 || $dayNumber > 6
// или перевернуть условие
if ($dayNumber > 1 && $dayNumber < 7) {
    var_dump("Это будний день");
} else {
    var_dump("Это выходной");
}
