<?php

// 1. Создайте переменную с названием код ошибки, положите в нее случайное значение от 1 до 3
// для каждого отдельного кода ошибки выведите сообщение:
// 1 - "Что-то пошло не так"
// 2 - "Что-то пошло так как надо, но мы этого не ждали"
// 3 - "Я в домике"
// # Момент видео 44:34 (Управляющие конструкции, циклы, приведение типов)
$errorCode = rand(1, 3);
switch ($errorCode) {
    case 1:
        var_dump("Что-то пошло не так");
        break;
    case 2:
        var_dump("Что-то пошло так как надо, но мы этого не ждали");
        break;
    case 3:
        var_dump("Я в домике");
        break;
}

// 2. Четный не с нами. Создайте переменную myNumber - в которую поместите случайное значение от 0 до 10
// Если это число четное (2, 4, 6, 8, 10) - то выведите сообщение: "Четный. Ты не с нами!", если это нечетное или 0 - то выведите "Добро пожаловать!"
// Для решения задачи применяйте switch, даже если очень хочется решить с if
// # Если не ставить break - то группу условий можно объединить, а еще можно применить default
$myNumber = rand(0, 10);
switch ($myNumber) {
    case 2:
    case 4:
    case 6:
    case 8:
        var_dump("Четный. Ты не с нами!");
        break;
    default:
        var_dump("Добро пожаловать!");
}

// 3. Создайте массив foods с продуктами питания: Яблоко, Клубника, Апельсин, Кабачок, Патиссон, Банан, Арбуз, Картошка, Лягушачие лапки
// Создайте переменную foodItem - случайное число от 0 до 8 (количество продуктов - 1)
// Определите к какому виду относится продукт из массива foods под индексов foodItem: "Ягода", "Фрукт", "Овощ", "Что-то не вегетарианское"
// Выведите сообщение: "Выбранный продукт {} - это {}", вместо {} подставьте соответственно название продукта и его вид
// # Создайте дополнительную переменную для вида продукта, а вывод сделайте в конце скрипта. Кстати, если вы слышите это название первый раз, то патиссоны на вкус как кабачки)
$foods = ['Яблоко', 'Клубника', 'Апельсин', 'Кабачок', 'Патиссон', 'Банан', 'Арбуз', 'Картошка', 'Лягушачие лапки'];
$foodItem = rand(0, count($foods) - 1);
$type = 'Что-то не вегетарианское';
switch ($foods[$foodItem]) {
    case 'Арбуз':
    case 'Клубника':
            $type = 'Ягода';
        break;
    case 'Яблоко':
    case 'Апельсин':
    case 'Банан':
        $type = 'Фрукт';
        break;
    case 'Картошка':
    case 'Кабачок':
    case 'Патиссон':
        $type = 'Овощ';
        break;
}
var_dump("Выбранный продукт {$foods[$foodItem]} - это {$type}");
