<?php

// Циклы для данных в массивах

// 1. Создайте массив boringToys скучных игрушек и случайного количества элементов от 1 до 10, где каждый элемент этого массива это ассоциативный массив с двумя полями:
// - Название игрушки: в виде "Игрушка 1"
// - Цена игрушки: случайное число от 100 до 1000
// # Подойдет цикл for, но не используйте его счетчик, чтобы записывать поля в массив, т.к. вы можете сразу добавить в качестве элемента ассоциативный массив


// 2. Создайте массив cars из трех машин: Мерседес - 10000 руб, BMW - 9999 руб, Автобус - 20000 руб.
// Объем данных о машинах будет увеличиваться, поэтому создайте ассоциативный массив с данными о машинах
// # А вот тут цикл не нужен


// 3. Посчитайте стоимость и выведите общую стоимость всех машин, и выведите ее
// # для итерации по массивам используйте foreach


// 4. Для каждой машины добавьте поле colors - возможные варианты цветов при этом для каждого цвета, есть своя надбавка к стоимости (разная для разных машин)
// Создайте массив colors с цветами для каждой машины и добавьте по три случайных цвета каждой машине для каждого цвета укажите надбавку - случайное число от 0 до 100
// Выведите этот массив и убедитесь в его правильности.
// # используйте ассоциативный массив для каждого цвета с двумя полями: цвет и надбавка
// # в цикле foreach можно использовать итерацию вместе с ключом или использовать ссылку на элемент массива, при использовании ссылки, будте осторожны, ведь переменная, со ссылкой на последний элемент существует и после цикла


// 5. Каталог автомобилей.
// А теперь выведите весь каталог автомобилей в виде: "Автомобиль {} цвета {} всего за: {} руб", вместо {} поставьте соответственно: название автомобиля, цвет, стоимость в этом цвете
// # Чтобы пройти по всем машинам нужен один foreach, а чтобы пройти по их цветам еще один внутри.
