<?php

// Задание 4 - Подсчет суммы элементов массива
// Создайте массив numbers случайной длины от 3 до 20. Каждое значение - это случайное число от 0 до 10
// Посчитайте сумму его элементов, стоящих под нечетным индексом.
// Выведите этот массив, и выведите полученную сумму
$numbers = [];
for ($i = 0; $i < rand(3, 20); $i++) {
    $numbers[] = rand(0, 10);
}

$sum = 0;
for ($i = 0; $i < count($numbers); $i++) {
    if ($i % 2 != 0) {
        $sum += $numbers[$i];
    }
}
// или
$sum = 0;
for ($i = 1; $i < count($numbers); $i += 2) {
    $sum += $numbers[$i];
}

var_dump(implode(', ', $numbers), $sum);
