<?php

// Задание 5 - Поиск max в двумерном массиве
// Матрица с числами должна быть прямоугольная, ее размер задается двумя случайными числами **m** и **n** от 3 до 10
// Создайте двумерный массив-матрицу matrix из случайных чисел от 0 до 9 размерности m x n
// Найдите в ней максимальное значение, и номер строки и столбца, где оно встречается первый раз.
// Выведите матрицу в удобном формате, а также это минимальное значение и номера строки и столбца, где оно встретилось первый раз
// Пример вывода:
// 1 4 1 1
// 4 2 6 3
// 1 7 2 2
// 0 0 0 7
// 4 5 7 0
// Минимальное значение: 7 на строке: 3 в столбце: 2


$m = rand(3, 10);
$n = rand(3, 10);
$matrix = [];
for ($i = 0; $i < $m; $i++) {
    $matrix[$i] = [];
    for ($j = 0; $j < $n; $j++) {
        $matrix[$i][] = rand(0, 9);
    }
}

$minI = 0;
$minJ = 0;

for ($i = 0; $i < count($matrix); $i++) {
    for ($j = 0; $j < count($matrix[$i]); $j++) {
        if ($matrix[$minI][$minJ] < $matrix[$i][$j]) {
            $minI = $i;
            $minJ = $j;
        }
    }
}

foreach ($matrix as $line) {
    echo implode(' ', $line) . PHP_EOL;
}

echo "Минимальное значение: {$matrix[$minI][$minJ]} на строке: " . ($minI + 1) . " в столбце: " . ($minJ + 1) . PHP_EOL;
